# -----------------ADVANCED DATAFRAMES EXERCISES I----------------------

Run python -m pip install pymysql from your terminal to install pymysql.

Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)


cd into your exercises folder for this module and run echo env.py >> .gitignore

In [ ]:
import pandas as pd

In [8]:
from env import host, user, password

In [9]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [82]:
employees_query = 'SELECT * FROM employees LIMIT 5 OFFSET 50'

pd.read_sql(employees_query, url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

3). Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

Use your function to obtain a connection to the employees database.

Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?


Answer: OperationalError

In [47]:
employees_database = 'employees'

def get_db_url(username, host, password, employees_database):
    
    return f'mysql+pymysql://{user}:{password}@{host}/employees'

In [58]:
get_db_url(user,host,password,database)

'mysql+pymysql://innis_1672:rpn487rUMAqvPsjCphhynfU9LMTUtcqv@data.codeup.com/employees'

In [57]:
pd.read_sql('Select * from employees Limit 5', get_db_url(user,host,password,database))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

b. Intentionally make an error in your SQL query. What does the error message look like?

Answer: 

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.empoyees' doesn't exist")
[SQL: Select * from empoyees Limit 5]
(Background on this error at: https://sqlalche.me/e/14/f405)

6). Read the employees and titles tables into two separate DataFrames.

In [56]:
employees_data_frame = pd.DataFrame(pd.read_sql('Select * from employees', get_db_url(user,host,password,employees_database)))
employees_data_frame

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [59]:
titles_database = 'titles'
titles_data_frame = pd.DataFrame(pd.read_sql('Select * from titles', get_db_url(user,host,password,titles_database)))
titles_data_frame

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

7). How many rows and columns do you have in each DataFrame? Is that what you expected?

In [64]:
employees_data_frame.shape()

(300024, 6)

In [71]:
titles_data_frame.shape

(443308, 4)

8). Display the summary statistics for each DataFrame.

In [68]:
employees_data_frame.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [69]:
titles_data_frame.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9). How many unique titles are in the titles DataFrame?

In [85]:
titles_data_frame.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10). What is the oldest date in the to_date column?

In [77]:
titles_data_frame.to_date.max()

datetime.date(9999, 1, 1)

11). What is the most recent date in the to_date column?

In [79]:
titles_data_frame.to_date.min()

datetime.date(1985, 3, 1)

# ----------------------ADVANCED DATAFRAME EXERCISE II-----------------------

1). Copy the users and roles DataFrames from the examples above.

2). What is the result of using a right join on the DataFrames?

3). What is the result of using an outer join on the DataFrames?

4). What happens if you drop the foreign keys from the DataFrames and try to merge them?

5). Load the mpg dataset from PyDataset.

6). Output and read the documentation for the mpg dataset.

7). How many rows and columns are in the dataset?

8). Check out your column names and perform any cleanup you may want on them.

9). Display the summary statistics for the dataset.

10). How many different manufacturers are there?

11). How many different models are there?

12). Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between 
highway and city mileage for each car.

13). Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the 
city and highway mileage.


14). Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic
transmission.

15). Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

16). Do automatic or manual cars have better miles per gallon?